# 1 - Data Frame:

In [1]:
import pandas as pd

### to create your own data frame

In [2]:
pd.DataFrame({'yes':[50,21],'no':[131,20]})

   yes   no
0   50  131
1   21   20

#### you can store also string in data frame

In [3]:
pd.DataFrame({'Bob':["I like it","I was awful"],'Sue':["Preety good","Bland"]})

           Bob          Sue
0    I like it  Preety good
1  I was awful        Bland

#### to name each line we use the label index

In [4]:
pd.DataFrame({'Bob':["I like it","I was awful"],'Sue':["Preety good","Bland"]},index=["product A","product B"])

                   Bob          Sue
product A    I like it  Preety good
product B  I was awful        Bland

#### series by contrast, is a sequence of data values. If a DataFrame is a table, a Series is a list. And in fact you can create one with nothing more than a list:

In [5]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
pd.Series([20,30,40,50],index=["2014 Sales","2015 Sales","2016 Sales","2017 Sales"],name="Product A")

2014 Sales    20
2015 Sales    30
2016 Sales    40
2017 Sales    50
Name: Product A, dtype: int64

###              reading data file CSV (comma,separated values)

In [7]:
data_sets = pd.read_csv("traffic_data.csv")

In [8]:
data_sets.shape

(85638, 6)

#### to display the 5 first line we use head method

In [9]:
data_sets.head()

   Unnamed: 0     day  minute  hour  second     type
0           0  Monday       0     8      14  traffic
1           1  Monday       0     8      28  traffic
2           2  Monday       0     8      34  traffic
3           3  Monday       0     8      45  traffic
4           4  Monday       0     8      53  traffic

In [10]:
data_sets = pd.read_csv("traffic_data.csv",index_col=0)
data_sets.head()

      day  minute  hour  second     type
0  Monday       0     8      14  traffic
1  Monday       0     8      28  traffic
2  Monday       0     8      34  traffic
3  Monday       0     8      45  traffic
4  Monday       0     8      53  traffic

#### there other ways to create data Frame like this one

In [11]:
data = pd.DataFrame([[12,13],[13,45]],columns=["number 1","number 2"])
data

   number 1  number 2
0        12        13
1        13        45

In [12]:
# to save data base in csv file use  data.to_csv("name_of_csv.csv")

# 1 - Indexing, Selecting & Assigning:

In [13]:
reviews = pd.read_csv("traffic_data.csv",index_col=0)

In [14]:
reviews

          day  minute  hour  second        type
0      Monday       0     8      14     traffic
1      Monday       0     8      28     traffic
2      Monday       0     8      34     traffic
3      Monday       0     8      45     traffic
4      Monday       0     8      53     traffic
...       ...     ...   ...     ...         ...
98042  Sunday      59    17      51  no_traffic
98043  Sunday       0    18       0  no_traffic
98044  Sunday       0    16      24  no_traffic
98045  Sunday       0    16      35  no_traffic
98047  Sunday       1    16      28  no_traffic

[85638 rows x 5 columns]

#### to access a column we use a dot . like the atribule of an object.

In [15]:
reviews.day

0        Monday
1        Monday
2        Monday
3        Monday
4        Monday
          ...
98042    Sunday
98043    Sunday
98044    Sunday
98045    Sunday
98047    Sunday
Name: day, Length: 85638, dtype: object

In [16]:
reviews["day"]

0        Monday
1        Monday
2        Monday
3        Monday
4        Monday
          ...
98042    Sunday
98043    Sunday
98044    Sunday
98045    Sunday
98047    Sunday
Name: day, Length: 85638, dtype: object

#### to access a spicifique value we use indexing just like dictionary.

In [17]:
reviews["day"][0]

'Monday'

#### to access the whole line we use iloc

In [18]:
reviews.iloc[0]

day        Monday
minute          0
hour            8
second         14
type      traffic
Name: 0, dtype: object

In [19]:
reviews.iloc[:,0]

0        Monday
1        Monday
2        Monday
3        Monday
4        Monday
          ...
98042    Sunday
98043    Sunday
98044    Sunday
98045    Sunday
98047    Sunday
Name: day, Length: 85638, dtype: object

In [20]:
reviews.iloc[0,:]

day        Monday
minute          0
hour            8
second         14
type      traffic
Name: 0, dtype: object

In [21]:
reviews.iloc[[1,50,200],:]

        day  minute  hour  second     type
1    Monday       0     8      28  traffic
50   Monday      12     8      28  traffic
204  Monday      50     8       0  traffic

In [22]:
reviews.iloc[[-1],:]

          day  minute  hour  second        type
98047  Sunday       1    16      28  no_traffic

#### the use of loc with data farme.

In [23]:
reviews.loc[0]

day        Monday
minute          0
hour            8
second         14
type      traffic
Name: 0, dtype: object

In [24]:
reviews.loc[0,"day"]

'Monday'

In [25]:
reviews.loc[[1,2],["day","minute","hour"]]

      day  minute  hour
1  Monday       0     8
2  Monday       0     8

##### loc indexes is inclusively so 1:10 ---> 1,...,10 .

In [26]:
reviews.loc[1:6,["day","minute","hour"]]

      day  minute  hour
1  Monday       0     8
2  Monday       0     8
3  Monday       0     8
4  Monday       0     8
5  Monday       0     8
6  Monday       1     8

##### iloc indexes is scheme so 1:10 ---> 1,...,9 .

In [27]:
reviews.iloc[1:6,[1,2]]

   minute  hour
1       0     8
2       0     8
3       0     8
4       0     8
5       0     8

#### conditional selection :

In [28]:
reviews.type == "traffic"

0         True
1         True
2         True
3         True
4         True
         ...
98042    False
98043    False
98044    False
98045    False
98047    False
Name: type, Length: 85638, dtype: bool

In [29]:
reviews.loc[reviews.type == "traffic"]

          day  minute  hour  second     type
0      Monday       0     8      14  traffic
1      Monday       0     8      28  traffic
2      Monday       0     8      34  traffic
3      Monday       0     8      45  traffic
4      Monday       0     8      53  traffic
...       ...     ...   ...     ...      ...
64026  Friday       2    16       2  traffic
64027  Friday       2    16      25  traffic
64028  Friday       2    16      30  traffic
64029  Friday       2    16      49  traffic
64030  Friday       2    16      55  traffic

[34869 rows x 5 columns]

In [34]:
reviews.loc[(reviews.type == "traffic") & (reviews.hour <= 8)]

          day  minute  hour  second     type
0      Monday       0     8      14  traffic
1      Monday       0     8      28  traffic
2      Monday       0     8      34  traffic
3      Monday       0     8      45  traffic
4      Monday       0     8      53  traffic
...       ...     ...   ...     ...      ...
58024  Friday      13     8      20  traffic
58025  Friday      13     8      24  traffic
58026  Friday      13     8      32  traffic
58027  Friday      13     8      55  traffic
58028  Friday      14     8      11  traffic

[4427 rows x 5 columns]

#### some build-in conditional selection :
##### isin check if the element that had been selected contine one the element of the list that we had allready proovide the methode isin with.

In [35]:
reviews.loc[reviews.minute.isin([0,13])]

          day  minute  hour  second        type
0      Monday       0     8      14     traffic
1      Monday       0     8      28     traffic
2      Monday       0     8      34     traffic
3      Monday       0     8      45     traffic
4      Monday       0     8      53     traffic
...       ...     ...   ...     ...         ...
97852  Sunday      13    17      38  no_traffic
97853  Sunday      13    17      58  no_traffic
98043  Sunday       0    18       0  no_traffic
98044  Sunday       0    16      24  no_traffic
98045  Sunday       0    16      35  no_traffic

[2931 rows x 5 columns]

##### check if one of the minute is not provide it

In [38]:
reviews.loc[reviews.hour.isnull()]

Empty DataFrame
Columns: [day, minute, hour, second, type]
Index: []

##### to add a new data we use dataframe["colom"] = value

In [39]:
reviews

          day  minute  hour  second        type
0      Monday       0     8      14     traffic
1      Monday       0     8      28     traffic
2      Monday       0     8      34     traffic
3      Monday       0     8      45     traffic
4      Monday       0     8      53     traffic
...       ...     ...   ...     ...         ...
98042  Sunday      59    17      51  no_traffic
98043  Sunday       0    18       0  no_traffic
98044  Sunday       0    16      24  no_traffic
98045  Sunday       0    16      35  no_traffic
98047  Sunday       1    16      28  no_traffic

[85638 rows x 5 columns]

##### to know info about each colomn of our data frame we usealy use summary finction like this one:

In [40]:
reviews.minute.describe()

count    85638.000000
mean        29.211483
std         17.384387
min          0.000000
25%         14.000000
50%         29.000000
75%         44.000000
max         59.000000
Name: minute, dtype: float64

#### to get the median we use

In [42]:
reviews.day.describe()

count      85638
unique         7
top       Sunday
freq       12278
Name: day, dtype: object

#### to calculate the modality we use the function mean:

In [58]:
reviews.minute.median()

29.0

In [43]:
reviews.hour.mean()

14.500712300614213

#### to see the unique value of a colomns we use :

In [44]:
reviews.hour.unique()

array([ 8,  9, 10, 12, 13, 14, 18, 19, 16, 17, 11, 15, 20, 21, 22])

In [45]:
reviews.day.unique()

array(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday',
       'Sunday'], dtype=object)

#### to see how many time a value is repeted we use value_counts() methode:

In [61]:
reviews.day.value_counts()

Sunday       12278
Saturday     12251
Thursday     12241
Wednesday    12237
Tuesday      12217
Monday       12212
Friday       12202
Name: day, dtype: int64

In [46]:
new_reviews = reviews.copy()

In [47]:
new_reviews

          day  minute  hour  second        type
0      Monday       0     8      14     traffic
1      Monday       0     8      28     traffic
2      Monday       0     8      34     traffic
3      Monday       0     8      45     traffic
4      Monday       0     8      53     traffic
...       ...     ...   ...     ...         ...
98042  Sunday      59    17      51  no_traffic
98043  Sunday       0    18       0  no_traffic
98044  Sunday       0    16      24  no_traffic
98045  Sunday       0    16      35  no_traffic
98047  Sunday       1    16      28  no_traffic

[85638 rows x 5 columns]

## MAP function:

#### the fisrt one is map function who return the serie after aplying the new function

In [49]:
new_reviews.type.map(lambda x: 1 if x=="traffic" else 0)

0        1
1        1
2        1
3        1
4        1
        ..
98042    0
98043    0
98044    0
98045    0
98047    0
Name: type, Length: 85638, dtype: int64

### to apply darictur to our data frame we use apply function in the following way:

In [51]:
new_reviews.apply(lambda x : 1 if x.type == "traffic" else 0,axis="columns")

0        1
1        1
2        1
3        1
4        1
        ..
98042    0
98043    0
98044    0
98045    0
98047    0
Length: 85638, dtype: int64

In [54]:
new_reviews["type"].apply(lambda x:1 if x=="traffic" else 0 )

0        1
1        1
2        1
3        1
4        1
        ..
98042    0
98043    0
98044    0
98045    0
98047    0
Name: type, Length: 85638, dtype: int64

In [55]:
reviews

          day  minute  hour  second        type
0      Monday       0     8      14     traffic
1      Monday       0     8      28     traffic
2      Monday       0     8      34     traffic
3      Monday       0     8      45     traffic
4      Monday       0     8      53     traffic
...       ...     ...   ...     ...         ...
98042  Sunday      59    17      51  no_traffic
98043  Sunday       0    18       0  no_traffic
98044  Sunday       0    16      24  no_traffic
98045  Sunday       0    16      35  no_traffic
98047  Sunday       1    16      28  no_traffic

[85638 rows x 5 columns]

In [56]:
reviews.second - reviews.second.mean()

0       -15.536724
1        -1.536724
2         4.463276
3        15.463276
4        23.463276
           ...
98042    21.463276
98043   -29.536724
98044    -5.536724
98045     5.463276
98047    -1.536724
Name: second, Length: 85638, dtype: float64

## Grouping and storing:

In [62]:
reviews

          day  minute  hour  second        type
0      Monday       0     8      14     traffic
1      Monday       0     8      28     traffic
2      Monday       0     8      34     traffic
3      Monday       0     8      45     traffic
4      Monday       0     8      53     traffic
...       ...     ...   ...     ...         ...
98042  Sunday      59    17      51  no_traffic
98043  Sunday       0    18       0  no_traffic
98044  Sunday       0    16      24  no_traffic
98045  Sunday       0    16      35  no_traffic
98047  Sunday       1    16      28  no_traffic

[85638 rows x 5 columns]

##### value_count() is a short cut of the groupby

In [65]:
reviews.groupby("hour").hour.count()

hour
8     6211
9     5988
10    6156
11    6046
12    6147
13    6052
14    6180
15    6110
16    6204
17    6076
18    6188
19    6036
20    6195
21    6046
22       3
Name: hour, dtype: int64

In [67]:
reviews.groupby("hour").apply(lambda df:df.type.iloc[0])

hour
8        traffic
9        traffic
10       traffic
11    no_traffic
12       traffic
13       traffic
14       traffic
15    no_traffic
16       traffic
17       traffic
18       traffic
19       traffic
20    no_traffic
21    no_traffic
22    no_traffic
dtype: object

In [76]:
reviews.groupby(["day","hour"]).apply(lambda df:df.type.iloc[0])

day        hour
Friday     8          traffic
           9          traffic
           10         traffic
           11      no_traffic
           12         traffic
                      ...
Wednesday  17         traffic
           18         traffic
           19         traffic
           20         traffic
           21      no_traffic
Length: 101, dtype: object

In [77]:
reviews.groupby("day").hour.agg([len,min,max])

             len  min  max
day
Friday     12202    8   22
Monday     12212    8   21
Saturday   12251    8   22
Sunday     12278    8   22
Thursday   12241    8   21
Tuesday    12217    8   21
Wednesday  12237    8   21

#### multi indexing :
##### we use the reset_index to tchange the index

In [86]:
reviews_colomn = reviews.groupby(["day","type"]).hour.agg(len).reset_index()
reviews_colomn

          day        type   hour
0      Friday  no_traffic   5213
1      Friday     traffic   6989
2      Monday  no_traffic   5240
3      Monday     traffic   6972
4    Saturday  no_traffic  12251
5      Sunday  no_traffic  12278
6    Thursday  no_traffic   5276
7    Thursday     traffic   6965
8     Tuesday  no_traffic   5227
9     Tuesday     traffic   6990
10  Wednesday  no_traffic   5284
11  Wednesday     traffic   6953

##### by default sort_values in ascending is True:

In [89]:
reviews_colomn.sort_values(by='hour')

          day        type   hour
0      Friday  no_traffic   5213
8     Tuesday  no_traffic   5227
2      Monday  no_traffic   5240
6    Thursday  no_traffic   5276
10  Wednesday  no_traffic   5284
11  Wednesday     traffic   6953
7    Thursday     traffic   6965
3      Monday     traffic   6972
1      Friday     traffic   6989
9     Tuesday     traffic   6990
4    Saturday  no_traffic  12251
5      Sunday  no_traffic  12278

In [90]:
reviews_colomn.sort_index()

          day        type   hour
0      Friday  no_traffic   5213
1      Friday     traffic   6989
2      Monday  no_traffic   5240
3      Monday     traffic   6972
4    Saturday  no_traffic  12251
5      Sunday  no_traffic  12278
6    Thursday  no_traffic   5276
7    Thursday     traffic   6965
8     Tuesday  no_traffic   5227
9     Tuesday     traffic   6990
10  Wednesday  no_traffic   5284
11  Wednesday     traffic   6953

In [91]:
reviews_colomn.sort_values(by=['type','hour'])

          day        type   hour
0      Friday  no_traffic   5213
8     Tuesday  no_traffic   5227
2      Monday  no_traffic   5240
6    Thursday  no_traffic   5276
10  Wednesday  no_traffic   5284
4    Saturday  no_traffic  12251
5      Sunday  no_traffic  12278
11  Wednesday     traffic   6953
7    Thursday     traffic   6965
3      Monday     traffic   6972
1      Friday     traffic   6989
9     Tuesday     traffic   6990

In [92]:
reviews.groupby("day").hour.mean()

day
Friday       14.506638
Monday       14.509663
Saturday     14.494980
Sunday       14.521176
Thursday     14.499714
Tuesday      14.475812
Wednesday    14.496936
Name: hour, dtype: float64

In [96]:
reviews.groupby(["day","hour"]).size()

day        hour
Friday     8       900
           9       841
           10      866
           11      853
           12      877
                  ...
Wednesday  17      845
           18      867
           19      864
           20      886
           21      870
Length: 101, dtype: int64